interface SeatingchartTypes {
  [key: string]: { [key: string]: { x: number; y: number } };
}

const SEATINGCHART: SeatingchartTypes = {
  1: {
    '1A': { x: 50, y: 200 },
    '2A': { x: 50, y: 250 },
    '3A': { x: 50, y: 300 },
    '4A': { x: 50, y: 350 },
    '5A': { x: 50, y: 400 },
    '1B': { x: 200, y: 400 },
    '2B': { x: 250, y: 400 },
    '3B': { x: 300, y: 400 },
    '4B': { x: 350, y: 400 },
    '1C': { x: 450, y: 400 },
    '2C': { x: 500, y: 400 },
    '3C': { x: 550, y: 400 },
    '4C': { x: 600, y: 400 },
    '1D': { x: 700, y: 400 },
    '2D': { x: 700, y: 350 },
    '3D': { x: 700, y: 300 },
    '4D': { x: 700, y: 250 },
    '5D': { x: 700, y: 200 },
    '1E': { x: 200, y: 200 },
    '2E': { x: 200, y: 250 },
    '1F': { x: 300, y: 200 },
    '2F': { x: 300, y: 250 },
    '1G': { x: 500, y: 200 },
    '2G': { x: 500, y: 250 },
    '1H': { x: 600, y: 200 },
    '2H': { x: 600, y: 250 },
    '4인용 스터디룸': { x: 509, y: 85 },
  },
};

export default SEATINGCHART;
